In [ ]:
import pandas as pd
exam = pd.read_csv('exam.csv')
exam

In [ ]:
exam.query('nclass == 1') # nclass 가 1인 행만 출력

In [ ]:
exam.query('nclass == 2')

In [ ]:
exam.query('nclass != 1') # nclass 가 1이 아닌 행 출력

In [ ]:
exam.query('nclass != 3')

In [ ]:
exam.query('math > 50') # math 가 50 보다 큰 행만 출력

In [ ]:
exam.query('math < 50')

In [ ]:
exam.query('english >= 50')

In [ ]:
exam.query('english <= 80')

In [ ]:
exam.query('nclass == 1 & math >= 50') # nclass가 1과 같고 math가 50보다 크거나 같음

In [ ]:
exam.query('nclass == 2 & english >=  80')

In [ ]:
exam.query('math >= 90 | english >= 90') # math가 90보다 크거나 english가 90보다 큼

In [ ]:
exam.query('english < 90 | science < 50')

In [ ]:
exam.query('nclass == 1 | nclass == 3 | nclass == 5') # 1, 3, 5 중 하나라도 참이면 출력

In [ ]:
exam.query('nclass in [1, 3, 5]') # 목록에 해당하는 행 추출

In [ ]:
nclass1 = exam.query('nclass == 1') # 추출한 행으로 데이터 생성
nclass2 = exam.query('nclass == 2')

nclass1 # 데이터 출력
nclass2

In [ ]:
nclass1['math'].mean() # 1반의 수학 점수 평균

In [ ]:
nclass2['math'].mean()

In [ ]:
df = pd.DataFrame(
    {'sex' : ['F', 'M', 'F', 'M'],
     'country' : ['Korea', 'China', 'Japan', 'USA']
    }
)
df # 문자 변수를 이용해 '전체 조건'과 '추출할 문자'에 해당하는 값 추출

In [ ]:
df.query('sex == "F" & country == "Korea"') ## 전체 조건과 추출한 문자의 따옴표는 달라야 함
df.query("sex == 'M' & country == 'China'")

# df.query('sex == 'F'' & country == 'Korea'') 같으면 에러남

In [ ]:
var = 3
exam.query('nclass == @var') # 외부 변수를 이용해 조건에 맞는 행 추출

In [ ]:
pd.set_option('display.max_rows', None) # 모든 행 출력하도록 설정
pd.set_option('display.max_columns',None) # 모든 열 출력 "

pd.reset_option('display.max_rows') # 설정 리셋
pd.reset_option('display.max_columns')

pd.reset_option('all') #모든 설정 리셋

In [ ]:
mpg = pd.read_csv('mpg.csv') # 6장 첫 번째 문제
mpg

In [ ]:
mpg_displ1 = mpg.query('displ <= 4') # Q1
mpg_displ1['hwy'].mean()

In [ ]:
mpg_displ2 = mpg.query('displ >= 5')
mpg_displ2['hwy'].mean()

In [ ]:
mpg_audi = mpg.query("manufacturer == 'audi'") # Q2
mpg_audi['cty'].mean()

In [ ]:
mpg_toyota = mpg.query("manufacturer == 'toyota'")
mpg_toyota['cty'].mean()

In [ ]:
mpg_manu = mpg.query("manufacturer in ['chevrolet', 'ford', 'honda']") # Q3
mpg_manu['hwy'].mean()

In [ ]:
exam['math'] # 필요한 행만 추출

In [ ]:
exam[['nclass', 'math', 'english']] # 여러 변수 추출

In [ ]:
exam['math'] # 값만 출력 (시리즈)
exam[['math']] # 대괄호를 두번 쓰면 행이름 유지 (데이터 프레임)

In [ ]:
exam.drop(columns='math') # 변수 제거
exam_d = exam.drop(columns='math') # 제거된 프레임을 변수로 지정해야 완전히 삭제됨

In [ ]:
exam.drop(columns = ['math', 'english'])

In [ ]:
exam.query('nclass == 1')['english'] # nclass가 1인 행만 추출 후 english 추출

In [ ]:
exam.query('math >= 50')[['id', 'math']] # math가 50 이상인 id, math 추출

In [ ]:
exam.query('math >= 50')[['id', 'math']].head() # 앞부분 5열(기본값)만 출력

In [ ]:
exam.query('math >= 50')[['id', 'math']].head(10) # 앞부분 10열만 출력

In [ ]:
## 명령어 뒤에 '\' 입력 후 엔터로 줄바꿈 - 가독성 증가

In [ ]:
# 두 번째 혼자서 해보기 Q1
mpg[['category', 'cty']] 
mpg_cc = mpg[['category', 'cty']] 

mpg_cc.head()

In [ ]:
# Q2
mpg_cc.query("category == 'suv'")['cty'].mean() # 13.5
mpg_cc.query("category == 'compact'")['cty'].mean() # 20.1

In [ ]:
exam.sort_values('math') # 오름차순 정렬
# exam.sort_values('math')[['math']]

In [ ]:
exam.sort_values('math', ascending = False) # 내림차순

In [ ]:
exam.sort_values(['nclass', 'math']) # 순서대로 정렬

In [ ]:
exam.sort_values(['nclass', 'math'], ascending = [True, False]) # 행 각각 다르게 정렬

In [ ]:
exam.assign(total = exam['math'] + exam['english'] + exam['science']) # 파생변수 추가

In [ ]:
exam.assign(
    # 합계
    total = exam['math'] + exam['english'] + exam['science'],
    # 평균
    mean = (exam['math'] + exam['english'] + exam['science']) / 3 
) #  여러개 추가

## drop과 마찬가지로 변수로 따로 선언해야 저장됨

In [ ]:

import numpy as np

exam.assign(test = np.where(exam['science'] >= 60, 'pass', 'fall')) # 조건이 참일 경우 pass 거짓일 경우 fall 출력

In [ ]:
exam.assign(total = exam['math'] + exam['english'] + exam['science'])\
    .sort_values('total', ascending = False) # 추가한 변수에 pandas 함수 활용

In [ ]:
# lambda 를 이용해 데이터 프레임명 줄이기
long_name = pd.read_csv('exam.csv')

long_name.assign(new = long_name['math'] + long_name['english'] + long_name['science'])

long_name.assign(new = lambda x: x['math'] + x['english'] + x['science']) 

# long_name 을 x로 치환

In [162]:
# 혼자서 해보기 세 번째 Q1
mpg_new = mpg.copy()
mpg_new = mpg_new.assign(CH = mpg_new['cty'] + mpg_new['hwy'])

In [163]:
# Q2
mpg_new = mpg_new.assign(CHmean = mpg_new['CH'] / 2)

In [168]:
# Q3
mpg_new.sort_values('CHmean', ascending=False).head(3)

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,category,CH,CHmean
221,volkswagen,new beetle,1.9,1999,4,manual(m5),f,35,44,d,subcompact,79,39.5
212,volkswagen,jetta,1.9,1999,4,manual(m5),f,33,44,d,compact,77,38.5
222,volkswagen,new beetle,1.9,1999,4,auto(l4),f,29,41,d,subcompact,70,35.0

In [169]:
# Q4
mpg.assign(total = lambda x: x['cty'] + x['hwy'],
    mean = lambda x: x['total'] / 2)\
    .sort_values('mean', ascending=False)\
    .head(3)
    
# 1, 2, 3 구문 연결

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,category,CH,total,mean
221,volkswagen,new beetle,1.9,1999,4,manual(m5),f,35,44,d,subcompact,79,79,39.5
212,volkswagen,jetta,1.9,1999,4,manual(m5),f,33,44,d,compact,77,77,38.5
222,volkswagen,new beetle,1.9,1999,4,auto(l4),f,29,41,d,subcompact,70,70,35.0

In [165]:
exam.agg(mean_math = ('math', 'mean')) # 행의 평균 추출

            math
mean_math  57.45

In [167]:
exam.groupby('nclass')\
    .agg(mean_math = ('math', 'mean') # groupby로 nclass 그룹화 후 agg함수로 math 평균 추출
)

        mean_math
nclass
1           46.25
2           61.25
3           45.00
4           56.75
5           78.00